@oniGino 

I am able to create  node with monitor as "none"   as below

```
resource "bigip_ltm_node" "staging-service" {
  name    = "/Common/staging-service"
  address = "staging.foo.com"
  monitor = "none"
}
```

```
HYD-ML-00064439:terraform-provider-bigip papineni$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_node.staging-service will be created
  + resource "bigip_ltm_node" "staging-service" {
      + address          = "staging.foo.com"
      + connection_limit = (known after apply)
      + dynamic_ratio    = (known after apply)
      + id               = (known after apply)
      + monitor          = "none"
      + name             = "/Common/staging-service"
      + rate_limit       = (known after apply)
      + ratio            = (known after apply)
      + session          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_ltm_node.staging-service: Creating...
bigip_ltm_node.staging-service: Creation complete after 1s [id=/Common/staging-service]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
HYD-ML-00064439:terraform-provider-bigip papineni$ cat terraform.tfstate
{
  "version": 4,
  "terraform_version": "0.13.5",
  "serial": 7,
  "lineage": "7f5bd9ec-420c-2e57-377c-ae7dc0d3fb39",
  "outputs": {},
  "resources": [
    {
      "mode": "managed",
      "type": "bigip_ltm_node",
      "name": "staging-service",
      "provider": "provider[\"registry.terraform.io/f5networks/bigip\"]",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "address": "staging.foo.com",
            "connection_limit": 0,
            "description": "",
            "dynamic_ratio": 1,
            "fqdn": [],
            "id": "/Common/staging-service",
            "monitor": "none",
            "name": "/Common/staging-service",
            "rate_limit": "disabled",
            "ratio": 1,
            "session": "user-enabled",
            "state": null
          },
          "private": "bnVsbA=="
        }
      ]
    }
  ]
}
```

```
HYD-ML-00064439:terraform-provider-bigip papineni$ terraform -version
Terraform v0.13.5
+ provider registry.terraform.io/f5networks/bigip v1.10.0
HYD-ML-00064439:terraform-provider-bigip papineni$ 
```

Can you try it once with monitor as "none"